{"key": "389-exception", "short_name": "389 Directory Server Exception to GPL 2.0", "name": "389 Directory Server Exception to GPL 2.0", "category": "Copyleft Limited", "owner": "Fedora", "homepage_url": "https://spdx.org/licenses/389-exception.html", "is_exception": true, "spdx_license_key": "389-exception", "text_urls": ["http://www.directory.fedora.redhat.com/wiki/GPL_Exception_License_Text"], "other_urls": ["http://directory.fedoraproject.org/wiki/GPL_Exception_License_Text", "http://www.gnu.org/licenses/gpl-2.0.txt"], "standard_notice": "This Program is free software; you can redistribute it and/or modify it\nunder the terms of the GNU General Public License as published by the Free\nSoftware Foundation; version 2 of the License.\nThis Program is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for\nmore details.\nYou should have received a copy of the GNU General Public License along\nwith this Program; if not, write to the Free Software Foundation, Inc., 59\nTemple Place, Suite 330, Boston, MA 02111-1307 USA.\nIn addition, as a special exception, Red Hat, Inc. gives You the additional\nright to link the code of this Program with code not covered under the GNU\nGeneral Public License (\"Non-GPL Code\") and to distribute linked\ncombinations including the two, subject to the limitations in this\nparagraph. Non-GPL Code permitted under this exception must only link to\nthe code of this Program through those well defined interfaces identified\nin the file named EXCEPTION found in the source code files (the \"Approved\nInterfaces\"). The files of Non-GPL Code may instantiate templates or use\nmacros or inline functions from the Approved Interfaces without causing the\nresulting work to be covered by the GNU General Public License. Only Red\nHat, Inc. may make changes or additions to the list of Approved Interfaces.\nYou must obey the GNU General Public License in all respects for all of the\nProgram code and other code used in conjunction with the Program except the\nNon-GPL Code covered by this exception. If you modify this file, you may\nextend this exception to your version of the file, but you are not\nobligated to do so. If you do not wish to provide this exception without\nmodification, you must delete this exception statement from your version\nand license this file solely under the GPL without exception.\n"}