{"key": "aptana-exception-3.0", "short_name": "Aptana exception to GPL 3.0", "name": "Aptana exception to GPL 3.0", "category": "Copyleft Limited", "owner": "Appcelerator", "homepage_url": "https://github.com/aptana/studio3/blob/development/README.md", "is_exception": true, "faq_url": "http://www.aptana.com/legal/gpl", "other_urls": ["http://www.gnu.org/licenses/gpl-3.0.txt"], "standard_notice": "This program Copyright (c) 2005-2015 by Appcelerator, Inc. This program is\ndistributed under the GNU General Public license. This program is free\nsoftware; you can redistribute it and/or modify it under the terms of the\nGNU General Public License, Version 3, as published by the Free Software\nFoundation.\nAny modifications must keep this entire license intact.\n-----------------------------------------------------------------------\nAppcelerator GPL Exception\nSection 7 Exception\nAs a special exception to the terms and conditions of the GNU General\nPublic License Version 3 (the \"GPL\"): You are free to convey a modified\nversion that is formed entirely from this file (for purposes of this\nexception, the \"Program\" under the GPL) and the works identified at\nhttp://www.aptana.com/legal/gpl (each an \"Excepted Work\"), which are\nconveyed to you by Appcelerator, Inc. and licensed under one or more of the\nlicenses identified in the Excepted License List below (each an \"Excepted\nLicense\"), as long as:\n1. you obey the GPL in all respects for the Program and the modified\nversion, except for Excepted Works which are identifiable sections of the\nmodified version, which are not derived from the Program, and which can\nreasonably be considered independent and separate works in themselves,\n2. all Excepted Works which are identifiable sections of the modified\nversion, which are not derived from the Program, and which can reasonably\nbe considered independent and separate works in themselves,\n1. are distributed subject to the Excepted License under which they were\noriginally licensed, and\n2. are not themselves modified from the form in which they are conveyed to\nyou by Aptana, and\n3. the object code or executable form of those sections are accompanied by\nthe complete corresponding machine-readable source code for those sections,\non the same medium as the corresponding object code or executable forms of\nthose sections, and are licensed under the applicable Excepted License as\nthe corresponding object code or executable forms of those sections, and\n3. any works which are aggregated with the Program, or with a modified\nversion on a volume of a storage or distribution medium in accordance with\nthe GPL, are aggregates (as defined in Section 5 of the GPL) which can\nreasonably be considered independent and separate works in themselves and\nwhich are not modified versions of either the Program, a modified version,\nor an Excepted Work.\nIf the above conditions are not met, then the Program may only be copied,\nmodified, distributed or used under the terms and conditions of the GPL or\nanother valid licensing option from Appcelerator, Inc. Terms used but not\ndefined in the foregoing paragraph have the meanings given in the GPL.\n-----------------------------------------------------------------------\nExcepted License List\n* Apache Software License: version 1.0, 1.1, 2.0\n* Eclipse Public License: version 1.0\n* GNU General Public License: version 2.0\n* GNU Lesser General Public License: version 2.0\n* License of Jaxer\n* License of HTML jTidy\n* Mozilla Public License: version 1.1\n* W3C License\n* BSD License\n* MIT License\n* Aptana Commercial Licenses\nThis list may be modified by Appcelerator from time to time. See\nAppcelerator's website for the latest version.\n-----------------------------------------------------------------------\nAttribution Requirement\nThis license does not grant any license or rights to use the trademarks\n\"Aptana,\" any \"Aptana\" logos, or any other trademarks of Appcelerator, Inc.\nYou are not authorized to use the name Aptana or the names of any author or\ncontributor for publicity purposes, without written authorization.\nHowever, in addition to the other notice obligations of this License, all\ncopies of any covered work conveyed by you must include on each user\ninterface screen and in the Appropriate Legal Notices the following text:\n\"Powered by Aptana\". On user interface screens, this text must be visibly\nand clearly displayed in the title bar, status bar, or otherwise directly\nin the view that is in focus.\n", "ignorable_urls": ["http://www.aptana.com/legal/gpl"]}