{"key": "bacula-exception", "short_name": "Bacula exception to AGPL 3.0", "name": "Bacula exception to AGPL 3.0", "category": "Copyleft Limited", "owner": "Bacula", "notes": "composite", "is_exception": true, "other_urls": ["http://www.gnu.org/licenses/"], "minimum_coverage": 70, "standard_notice": "Last revision: 21 May 2017\nBacula is licensed under the GNU Affero General Public License, version\n3.0 as published by the Free Software Foundation, Inc. (\"AGPLv3\").\nAdditional Terms on the work licensed herein, pursuant to Section 7 of\nAffero General Public License are as follows:\n1. The name Bacula is a registered trademark of Kern Sibbald, and Kern\nSibbald hereby declines to grant a trademark license to \"Bacula\"\npursuant to AGPLv3, Section 7(e) without a separate agreement with Kern\nSibbald.\n2. Pursuant to AGPLv3, Section 7(a), in addition to the warranty and\nliability disclaimers already found in AGPLv3, the copyright holders\nspecifically disclaim any liability for accusations of patent\ninfringement by any third party.\n3. Pursuant to AGPLv3, Section 7(b), the portions of the file AUTHORS that\nare deemed to be specified reasonable legal notices and/or author\nattributions shall be preserved in redistribution of source code and/or\nmodifications thereof. Furthermore, when the following notice appears in\na source code file, it must be preserved when source code is conveyed\nand/or propagated:\nBacula(R) - The Network Backup Solution\nCopyright (C) 2000-2017 Kern Sibbald\nThe original author of Bacula is Kern Sibbald, with contributions\nfrom many others, a complete list can be found in the file AUTHORS.\nYou may use this file and others of this release according to the\nlicense defined in the LICENSE file, which includes the Affero General\nPublic License, v3.0 (\"AGPLv3\") and some additional permissions and\nterms pursuant to its AGPLv3 Section 7.\nThis notice must be preserved when any source code is conveyed\nand/or propagated.\nBacula(R) is a registered trademark of Kern Sibbald.\nAdditional Permissions on the work licensed herein, pursuant to Section 7\nof\nAGPLv3 are as follows:\n1. As a special exception to the AGPLv3, the copyright holders give\npermission to link the code of its release of Bacula with the OpenSSL\nproject's \"OpenSSL\" library (or with modified versions of it that use the\nsame license as the \"OpenSSL\" library), and distribute the linked\nexecutables. You must follow the requirements of AGPLv3 in all respects\nfor all of the code used other than \"OpenSSL\".\n2. As a special exception to the AGPLv3, the copyright holders give\npermission to link the code of its release of the Bacula Win32 File daemon\nwith the Microsoft supplied Volume Shadow Copy (VSS) libraries and\ndistribute the linked executables. You must follow the requirements of\nthe AGPLv3 in all respects for all of the code used other than for the\nMicrosoft VSS code.\nIf you want to fork Bacula, please read the file LICENSE-FAQ.\nThe copyright for certain source files may include in addition to what is\nlisted above the following copyright:\nCopyright (C) 2000-2014 Free Software Foundation Europe e.V.\nThe copyright on the Baculum code is:\nCopyright (C) 2013-2017 Marcin Haba\nCopyrights of certain \"script\" files such as headers, shell script,\nMakefiles,\netc ... were previously never explicitly defined. In almost all cases,\nthey have been copyrighted with a BSD 2-Clause copyright to make them\neasier. However, as is the case of all BSD type copyrights you must keep\nthe copyright in place and on any binary only released the copyright notice\nmust also be released with the binaries. An example of such a copyright\nis:\n#\n# Copyright (C) 2000-2017 Kern Sibbald\n# License: BSD 2-Clause; see file LICENSE-FOSS\n#\nIt is equivalent to the full BSD copyright of:\n=====\nCopyright (C) 2000-2017 Kern Sibbald\nLicense: BSD 2-Clause; see file LICENSE-FOSS\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n1. Redistributions of source code must retain the above copyright notice,\nthis list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\nnotice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\nLIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\nUSE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n====\nNote: the exact form of the copyright (dates, name, and text formatting)\nmight vary, but the intent is the same, namely that the full BSD 2-Clause\ncoypright applies. The file LICENSE-FOSS has a few more details.\n######################################################################\nThe entire AGPL is below, in the manuals distributed with the Bacula\ndocumentation and can also be found online on the GNU web site at\nwww.bacula.org. You may also obtain a copy of the AGPL (or LGPL) by writing\nto: Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA\n02110-1301 USA\n", "ignorable_copyrights": ["Copyright (c) 2000-2014 Free Software Foundation Europe e.V.", "Copyright (c) 2000-2017 Kern Sibbald", "Copyright (c) 2013-2017 Marcin Haba"], "ignorable_holders": ["Free Software Foundation Europe e.V.", "Kern Sibbald", "Marcin Haba"]}