{"key": "cygwin-exception-3.0", "short_name": "Cygwin exception to GPL 3.0 or later", "name": "Cygwin exception to GPL 3.0 or later", "category": "Copyleft Limited", "owner": "Cygwin Project", "homepage_url": "http://cygwin.com/licensing.html", "is_exception": true, "text_urls": ["http://cygwin.com/cgi-bin/cvsweb.cgi/src/winsup/CYGWIN_LICENSE?cvsroot=src"], "other_urls": ["http://www.gnu.org/licenses/gpl-3.0.txt", "http://www.opensource.org/docs/osd/", "http://www.redhat.com/software/cygwin/", "http://www.redhat.com/about/contact/ww/"], "standard_notice": "Cygwin is free software. Red Hat, Inc. licenses Cygwin to you under the\nterms of the GNU General Public License as published by the Free Software\nFoundation; you can redistribute it and/or modify it under the terms of\nthe GNU General Public License either version 3 of the license, or (at your\noption) any later version (GPLv3+), along with the additional permissions\ngiven below.\nThere is NO WARRANTY for this software, express or implied, including\nthe implied warranties of MERCHANTABILITY or FITNESS FOR A PARTICULAR\nPURPOSE. See the GNU General Public License for more details.\nYou should have received a copy of the GNU General Public License along\nwith this program. If not, see <http://gnu.org/licenses/>.\nAdditional Permissions:\n1. Linking Exception.\nAs a special exception to GPLv3+, Red Hat grants you permission to link\nsoftware whose sources are distributed under a license that satisfies\nthe Open Source Definition with libcygwin.a, without libcygwin.a\nitself causing the resulting program to be covered by GPLv3+.\nThis means that you can port an Open Source application to Cygwin, and\ndistribute that executable as if it didn't include a copy of\nlibcygwin.a linked into it. Note that this does not apply to the\nCygwin DLL itself. If you distribute a (possibly modified) version of\nthe Cygwin DLL, you must adhere to the terms of GPLv3+, including the\nrequirement to provide sources for the Cygwin DLL, unless you have obtained\na special Cygwin license to distribute the Cygwin DLL in only its binary\nform (see below).\nSee http://www.opensource.org/docs/osd/ for the precise Open Source\nDefinition referenced above.\n2. Files Excluded from GPL Coverage.\nRed Hat grants you permission to distribute Cygwin with the following\nfiles, which are not considered part of Cygwin and are not governed by\nGPLv3+, in source or binary form.\nwinsup\\testsuite\\winsup.api\\msgtest.c\nwinsup\\testsuite\\winsup.api\\semtest.c\nwinsup\\testsuite\\winsup.api\\shmtest.c\nRed Hat grants you permission to link or combine code in Cygwin with\ncode in or corresponding to the following files, which are not\nconsidered part of Cygwin and are not governed by GPLv3+, and to\ndistribute such combinations under terms of your choice, provided that\nsuch terms are otherwise consistent with the application of GPLv3+ to\nCygwin itself. You must comply with GPLv3+ with respect to all\nportions of such combinations other than those that correspond to or\nare derived from such non-Cygwin code but which do not correspond to\nor are not derived from Cygwin itself.\nwinsup\\cygserver\\sysv_shm.cc\n3. Alternative License.\nRed Hat sells a special Cygwin License for customers who are unable to\nprovide their application in open source code form. For more\ninformation, please see: http://www.redhat.com/software/cygwin/, or call\n+1-866-2REDHAT ext. 45300 (toll-free in the US).\nOutside the US call your regional Red Hat office, see\nhttp://www.redhat.com/about/contact/ww/\n"}