{"key": "digirule-foss-exception", "short_name": "DigiRule FOSS Exception to GPL 2.0", "name": "DigiRule FOSS License Exception to GPL 2.0", "category": "Copyleft Limited", "owner": "bradsprojects", "homepage_url": "https://bradsprojects.com/the-digirule/", "is_exception": true, "spdx_license_key": "DigiRule-FOSS-exception", "other_urls": ["http://www.digirulesolutions.com/drupal/foss", "http://www.gnu.org/licenses/gpl-2.0.txt", "https://www.bradsprojects.com/wp-content/uploads/2015/10/Digirule_Files_04_July_2017.zip"], "standard_notice": "DigiRule Solutions's FOSS License Exception Terms and Conditions\n1. Definitions.\n\"Derivative Work\" means a derivative work, as defined under applicable\ncopyright law, formed entirely from the Program and one or more FOSS\nApplications.\n\"FOSS Application\" means a free and open source software application\ndistributed subject to a license listed in the section below titled \"FOSS\nLicense List.\"\n\"FOSS Notice\" means a notice placed by DigiRule Solutions in a copy of the\nClient Libraries stating that such copy of the Client Libraries may be\ndistributed under DigiRule Solutions's or FOSS License Exception.\n\"Independent Work\" means portions of the Derivative Work that are not\nderived from the Program and can reasonably be considered independent and\nseparate works.\n\"Program\" means a copy of DigiRule Solutions's Client Libraries that\ncontain a FOSS Notice.\n2. A FOSS application developer (\"you\" or \"your\") may distribute a\nDerivative Work provided that you and the Derivative Work meet all of the\nfollowing conditions:\n1. You obey the GPL in all respects for the Program and all portions\n(including modifications) of the Program included in the Derivative Work\n(provided that this condition does not apply to Independent Works);\n2. The Derivative Work does not include any work licensed under the GPL\nother than the Program;\n3. You distribute Independent Works subject to a license listed in the\nsection below titled \"FOSS License List\";\n4. You distribute Independent Works in object code or executable form with\nthe complete corresponding machine-readable source code on the same medium\nand under the same FOSS license applying to the object code or executable\nforms;\n5. All works that are aggregated with the Program or the Derivative Work on\na medium or volume of storage are not derivative works of the Program,\nDerivative Work or FOSS Application, and must reasonably be considered\nindependent and separate works.\n3. DigiRule Solutions reserves all rights not expressly granted in these\nterms and conditions. If all of the above conditions are not met, then this\nFOSS License Exception does not apply to you or your Derivative Work.\nFOSS License List\nLicense Name Version(s)/Copyright Date\nRelease Early Certified Software\nAcademic Free License 2.0\nApache Software License 1.0/1.1/2.0\nApple Public Source License 2.0\nArtistic license From Perl 5.8.0\nBSD license \"July 22 1999\"\nCommon Development and Distribution License (CDDL) 1.0\nCommon Public License 1.0\nEclipse Public License 1.0\nGNU Library or \"Lesser\" General Public License (LGPL) 2.0/2.1/3.0\nJabber Open Source License 1.0\nMIT License (As listed in file MIT-License.txt) -\nMozilla Public License (MPL) 1.0/1.1\nOpen Software License 2.0\nOpenSSL license (with original SSLeay license) \"2003\" (\"1998\")\nPHP License 3.0/3.01\nPython license (CNRI Python License) -\nPython Software Foundation License 2.1.1\nSleepycat License \"1999\"\nUniversity of Illinois/NCSA Open Source License -\nW3C License \"2001\"\nX11 License \"2001\"\nZlib/libpng License -\nZope Public License 2.0\n"}