{"key": "digia-qt-exception-lgpl-2.1", "is_deprecated": true, "short_name": "Digia Qt Exception to LGPL 2.1", "name": "Digia Qt Exception to LGPL 2.1", "category": "Copyleft Limited", "owner": "Digia", "is_exception": true, "other_urls": ["http://www.gnu.org/licenses/lgpl-2.1.txt"], "standard_notice": "This library is free software; you can redistribute it and/or modify it\nunder the terms of the GNU Lesser General Public License as published by\nthe Free Software Foundation; either version 2.1 of the License, or (at\nyour option) any later version.\nThis library is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License\nfor more details.\nYou should have received a copy of the GNU Lesser General Public License\nalong with this library; if not, write to the Free Software Foundation,\nInc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n\nDigia Qt LGPL Exception version 1.1\nAs an additional permission to the GNU Lesser General Public License\nversion\n2.1, the object code form of a \"work that uses the Library\" may incorporate\nmaterial from a header file that is part of the Library. You may distribute\nsuch object code under terms of your choice, provided that:\n(i) the header files of the Library have not been modified; and\n(ii) the incorporated material is limited to numerical parameters, data\nstructure layouts, accessors, macros, inline functions and\ntemplates; and\n(iii) you comply with the terms of Section 6 of the GNU Lesser General\nPublic License version 2.1.\nMoreover, you may apply this exception to a modified version of the\nLibrary,\nprovided that such modification does not involve copying material from the\nLibrary into the modified Library's header files unless such material is\nlimited to (i) numerical parameters; (ii) data structure layouts;\n(iii) accessors; and (iv) small macros, templates and inline functions of\nfive lines or less in length.\nFurthermore, you are not required to apply this additional permission to a\nmodified version of the Library."}