{"key": "gcc-exception-3.1", "short_name": "GCC Runtime Library Exception v3.1", "name": "GCC Runtime Library Exception v3.1", "category": "Copyleft Limited", "owner": "Free Software Foundation (FSF)", "homepage_url": "http://www.gnu.org/licenses/gcc-exception-3.1.html", "is_exception": true, "spdx_license_key": "GCC-exception-3.1", "text_urls": ["http://www.gnu.org/licenses/gcc-exception-3.1.html"], "faq_url": "http://www.gnu.org/licenses/gcc-exception-3.1-faq.html", "other_urls": ["http://www.gnu.org/licenses/gpl-3.0.txt"], "standard_notice": "This program is free software: you can redistribute it and/or modify it\nunder the terms of the GNU General Public License as published by the Free\nSoftware Foundation, either version 3 of the License, or (at your option)\nany later version.\nThis program is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for\nmore details.\nYou should have received a copy of the GNU General Public License along\nwith this program. If not, see <http://www.gnu.org/licenses/>.\nGCC RUNTIME LIBRARY EXCEPTION\nVersion 3.1, 31 March 2009\nCopyright © 2009 Free Software Foundation, Inc. <http://fsf.org/>\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\nThis GCC Runtime Library Exception (\"Exception\") is an additional\npermission under section 7 of the GNU General Public License, version 3\n(\"GPLv3\"). It applies to a given file (the \"Runtime Library\") that bears a\nnotice placed by the copyright holder of the file stating that the file is\ngoverned by GPLv3 along with this Exception.\nWhen you use GCC to compile a program, GCC may combine portions of certain\nGCC header files and runtime libraries with the compiled program. The\npurpose of this Exception is to allow compilation of non-GPL (including\nproprietary) programs to use, in this way, the header files and runtime\nlibraries covered by this Exception.\n0. Definitions.\nA file is an \"Independent Module\" if it either requires the Runtime Library\nfor execution after a Compilation Process, or makes use of an interface\nprovided by the Runtime Library, but is not otherwise based on the Runtime\nLibrary.\n\"GCC\" means a version of the GNU Compiler Collection, with or without\nmodifications, governed by version 3 (or a specified later version) of the\nGNU General Public License (GPL) with the option of using any subsequent\nversions published by the FSF.\n\"GPL-compatible Software\" is software whose conditions of propagation,\nmodification and use would permit combination with GCC in accord with the\nlicense of GCC.\n\"Target Code\" refers to output from any compiler for a real or virtual\ntarget processor architecture, in executable form or suitable for input to\nan assembler, loader, linker and/or execution phase. Notwithstanding that,\nTarget Code does not include data in any format that is used as a compiler\nintermediate representation, or used for producing a compiler intermediate\nrepresentation.\nThe \"Compilation Process\" transforms code entirely represented in non-\nintermediate languages designed for human-written code, and/or in Java\nVirtual Machine byte code, into Target Code. Thus, for example, use of\nsource code generators and preprocessors need not be considered part of the\nCompilation Process, since the Compilation Process can be understood as\nstarting with the output of the generators or preprocessors.\nA Compilation Process is \"Eligible\" if it is done using GCC, alone or with\nother GPL-compatible software, or if it is done without using any work\nbased on GCC. For example, using non-GPL-compatible Software to optimize\nany GCC intermediate representations would not qualify as an Eligible\nCompilation Process.\n1. Grant of Additional Permission.\nYou have permission to propagate a work of Target Code formed by combining\nthe Runtime Library with Independent Modules, even if such propagation\nwould otherwise violate the terms of GPLv3, provided that all Target Code\nwas generated by Eligible Compilation Processes. You may then convey such a\ncombination under terms of your choice, consistent with the licensing of\nthe Independent Modules.\n2. No Weakening of GCC Copyleft.\nThe availability of this Exception does not imply any general presumption\nthat third-party software is unaffected by the copyleft requirements of the\nlicense of GCC.\n", "ignorable_copyrights": ["Copyright (c) 2009 Free Software Foundation, Inc. <http://fsf.org/>"], "ignorable_holders": ["Free Software Foundation, Inc."], "ignorable_urls": ["http://fsf.org/"]}