{"key": "geoserver-exception-2.0-plus", "short_name": "GeoServer exception to GPL 2.0 or later", "name": "GeoServer exception to GPL 2.0 or later", "category": "Copyleft Limited", "owner": "Open Source Geospatial Foundation", "homepage_url": "http://geoserver.org/", "is_exception": true, "text_urls": ["https://master.dl.sourceforge.net/project/geoserver/GeoServer/2.5/geoserver-2.5-src.zip"], "other_urls": ["http://geoserver.org/", "http://openplans.org", "http://www.gnu.org/licenses/gpl-2.0.txt"], "standard_notice": "This program is free software; you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 2 of the License, or\n(at your option) any later version (collectively, \"GPL\").\nAs an exception to the terms of the GPL, you may copy, modify,\npropagate, and distribute a work formed by combining GeoServer with the\nEclipse Libraries, or a work derivative of such a combination, even if\nsuch copying, modification, propagation, or distribution would otherwise\nviolate the terms of the GPL. Nothing in this exception exempts you from\ncomplying with the GPL in all respects for all of the code used other\nthan the Eclipse Libraries. You may include this exception and its grant\nof permissions when you distribute GeoServer. Inclusion of this notice\nwith such a distribution constitutes a grant of such permissions. If\nyou do not wish to grant these permissions, remove this paragraph from\nyour distribution. \"GeoServer\" means the GeoServer software licensed\nunder version 2 or any later version of the GPL, or a work based on such\nsoftware and licensed under the GPL. \"Eclipse Libraries\" means Eclipse\nModeling Framework Project and XML Schema Definition software\ndistributed by the Eclipse Foundation and licensed under the Eclipse\nPublic License Version 1.0 (\"EPL\"), or a work based on such software and\nlicensed under the EPL.\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU General Public License for more details.\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, write to the Free Software\nFoundation, Inc., 51 Franklin Street, Suite 500, Boston, MA 02110-1335 USA\n"}