{"key": "hdf4", "short_name": "HDF4 License", "name": "HDF4 License", "category": "Permissive", "owner": "The HDF Group", "homepage_url": "https://bitbucket.hdfgroup.org/projects/HDFFR/repos/hdf4/browse/COPYING?raw", "other_urls": ["https://support.hdfgroup.org/ftp/HDF/releases/HDF4.2.14/src/hdf-4.2.14.tar.bz2"], "standard_notice": "Copyright Notice and License Terms for\nHierarchical Data Format (HDF) Software Library and Utilities\n---------------------------------------------------------------------------\nHierarchical Data Format (HDF) Software Library and Utilities\nCopyright 2006 by The HDF Group.\nNCSA Hierarchical Data Format (HDF) Software Library and Utilities\nCopyright 1988-2006 by the Board of Trustees of the University of Illinois.\nAll rights reserved.\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted for any purpose (including commercial purposes)\nprovided that the following conditions are met:\n1. Redistributions of source code must retain the above copyright notice,\nthis list of conditions, and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\nnotice,\nthis list of conditions, and the following disclaimer in the documentation\nand/or materials provided with the distribution.\n3. In addition, redistributions of modified forms of the source or binary\ncode must carry prominent notices stating that the original code was\nchanged and the date of the change.\n4. All publications or advertising materials mentioning features or use of\nthis software are asked, but not required, to acknowledge that it was\ndeveloped by The HDF Group and by the National Center for Supercomputing\nApplications at the University of Illinois at Urbana-Champaign and\ncredit the contributors.\n5. Neither the name of The HDF Group, the name of the University, nor the\nname of any Contributor may be used to endorse or promote products derived\nfrom this software without specific prior written permission from The HDF\nGroup, the University, or the Contributor, respectively.\nDISCLAIMER:\nTHIS SOFTWARE IS PROVIDED BY THE HDF GROUP AND THE CONTRIBUTORS \"AS IS\"\nWITH NO WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED. In no event\nshall The HDF Group or the Contributors be liable for any damages suffered\nby the users arising out of the use of this software, even if advised of\nthe possibility of such damage.\n---------------------------------------------------------------------------\n---------------------------------------------------------------------------\nContributors: National Center for Supercomputing Applications (NCSA) at\nthe University of Illinois, Fortner Software, Unidata Program Center\n(netCDF),\nThe Independent JPEG Group (JPEG), Jean-loup Gailly and Mark Adler (gzip),\nand Digital Equipment Corporation (DEC).\n---------------------------------------------------------------------------\n", "ignorable_authors": ["The HDF Group"]}