{"key": "libmng-2007", "short_name": "libmng License 2007", "name": "libmng License 2007", "category": "Permissive", "owner": "libmng Project", "other_urls": ["http://www.linuxfromscratch.org/blfs/view/cvs/general/libmng.html"], "standard_notice": "Copyright (c) 2000-2007 Gerard Juyn (gerard@libmng.com)\n[You may insert additional notices after this sentence if you modify\nthis source]\nFor the purposes of this copyright and license, \"Contributing Authors\"\nis defined as the following set of individuals:\nGerard Juyn\nGlenn Randers-Pehrson\nThe MNG Library is supplied \"AS IS\". The Contributing Authors\ndisclaim all warranties, expressed or implied, including, without\nlimitation, the warranties of merchantability and of fitness for any\npurpose. The Contributing Authors assume no liability for direct,\nindirect, incidental, special, exemplary, or consequential damages,\nwhich may result from the use of the MNG Library, even if advised of\nthe possibility of such damage.\nPermission is hereby granted to use, copy, modify, and distribute this\nsource code, or portions hereof, for any purpose, without fee, subject\nto the following restrictions:\n1. The origin of this source code must not be misrepresented;\nyou must not claim that you wrote the original software.\n2. Altered versions must be plainly marked as such and must not be\nmisrepresented as being the original source.\n3. This Copyright notice may not be removed or altered from any source\nor altered source distribution.\nThe Contributing Authors specifically permit, without fee, and\nencourage the use of this source code as a component to supporting\nthe MNG and JNG file format in commercial products. If you use this\nsource code in a product, acknowledgment would be highly appreciated.\nParts of this software have been adapted from the libpng package.\nAlthough this library supports all features from the PNG specification\n(as MNG descends from it) it does not require the libpng package.\nIt does require the zlib library and optionally the IJG jpeg library,\nand/or the \"little-cms\" library by Marti Maria (depending on the\ninclusion of support for JNG and Full-Color-Management respectively.\nThis library's function is primarily to read and display MNG\nanimations. It is not meant as a full-featured image-editing\ncomponent! It does however offer creation and editing functionality\nat the chunk level.\n(future modifications may include some more support for creation\nand or editing)\n"}