{"key": "merit-network-derivative", "short_name": "Merit Network Derivative Works License", "name": "Merit Network Derivative Works License", "category": "Copyleft", "owner": "Merit Network", "homepage_url": "http://web.mit.edu/kolya/.f/root/athena.mit.edu/net/project/radius/3.6B/src/resources.c", "standard_notice": "/*\n* Copyright [C] The Regents of the University of Michigan and Merit\nNetwork,\n* Inc. 1992, 1993, 1994, 1995, 1996, 1997, 1998 All Rights Reserved\n*\n* Permission to use, copy, and modify this software and its documentation\n* for any purpose and without fee is hereby granted, provided:\n*\n* 1) that the above copyright notice and this permission notice appear in\nall\n* copies of the software and derivative works or modified versions thereof,\n*\n* 2) that both the copyright notice and this permission and disclaimer\nnotice\n* appear in all supporting documentation, and\n*\n* 3) that all derivative works made from this material are returned to the\n* Regents of the University of Michigan and Merit Network, Inc. with\n* permission to copy, to display, to distribute, and to make derivative\n* works from the provided material in whole or in part for any purpose.\n*\n* Users of this code are requested to notify Merit Network, Inc. of such\nuse\n* by sending email to aaa-admin@merit.edu\n*\n* Please also use aaa-admin@merit.edu to inform Merit Network, Inc of any\n* derivative works.\n*\n* Distribution of this software or derivative works or the associated\n* documentation is not allowed without an additional license.\n*\n* Licenses for other uses are available on an individually negotiated\n* basis. Contact aaa-license@merit.edu for more information.\n*\n* THIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER\n* EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION WARRANTIES OF\n* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE REGENTS OF THE\n* UNIVERSITY OF MICHIGAN AND MERIT NETWORK, INC. DO NOT WARRANT THAT THE\n* FUNCTIONS CONTAINED IN THE SOFTWARE WILL MEET LICENSEE'S REQUIREMENTS OR\n* THAT OPERATION WILL BE UNINTERRUPTED OR ERROR FREE. The Regents of the\n* University of Michigan and Merit Network, Inc. shall not be liable for\nany\n* special, indirect, incidental or consequential damages with respect to\nany\n* claim by Licensee or any third party arising from use of the software.\n*\n* Merit AAA Server Support\n* Merit Network, Inc.\n* 4251 Plymouth Road, Suite C.\n* Ann Arbor, Michigan, USA 48105-2785\n*\n* attn: John Vollbrecht\n* voice: 734-764-9430\n* fax: 734-647-3185\n* email: aaa-admin@merit.edu\n*\n*/\n", "ignorable_emails": ["aaa-admin@merit.edu", "aaa-license@merit.edu"]}