{"key": "mini-xml-exception-lgpl-2.0", "short_name": "Mini-XML exception to LGPL 2.0", "name": "Mini-XML exception to LGPL 2.0", "category": "Copyleft Limited", "owner": "Mini-XML", "homepage_url": "http://www.minixml.org/documentation.php/license.html", "is_exception": true, "other_urls": ["http://www.gnu.org/licenses/lgpl-2.0.txt"], "standard_notice": "This library is free software; you can redistribute it and/or modify it\nunder the terms of the GNU Library General Public License as published by\nthe Free Software Foundation; either version 2 of the License, or (at your\noption) any later version.\nThis library is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public\nLicense for more details.\nYou should have received a copy of the GNU Library General Public License\nalong with this library; if not, write to the Free Software Foundation,\nInc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\nMini-XML License (LGPL 2.0 with Exception)\nThe Mini-XML library and included programs are provided under the terms of\nthe GNU Library General Public License (LGPL) with the following\nexceptions:\n1. Static linking of applications to the Mini-XML library does not\nconstitute a derivative work and does not require the author to provide\nsource code for the application, use the shared Mini-XML libraries, or link\ntheir applications against a user-supplied version of Mini-XML.\nIf you link the application to a modified version of Mini-XML, then the\nchanges to Mini-XML must be provided under the terms of the LGPL in\nsections 1, 2, and 4.\n2. You do not have to provide a copy of the Mini-XML license with programs\nthat are linked to the Mini-XML library, nor do you have to identify the\nMini-XML license in your program or documentation as required by section 6\nof the LGPL.\nGNU Library General Public License (LGPL 2.0)\nhttp://www.gnu.org/licenses/old-licenses/lgpl-2.0.html - TOC1\n", "ignorable_urls": ["http://www.gnu.org/licenses/old-licenses/lgpl-2.0.html"]}