{"key": "openssl-exception-agpl-3.0", "short_name": "OpenSSL exception to AGPL 3.0", "name": "OpenSSL exception to AGPL 3.0", "category": "Copyleft Limited", "owner": "MongoDB", "is_exception": true, "standard_notice": "This program is free software: you can redistribute it and/or modify\nit under the terms of the GNU Affero General Public License as\npublished by the Free Software Foundation, either version 3 of the\nLicense, or (at your option) any later version.\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU Affero General Public License for more details.\nYou should have received a copy of the GNU Affero General Public License\nalong with this program. If not, see <http://www.gnu.org/licenses/>.\nAlso add information on how to contact you by electronic and paper mail.\nIf your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to get\nits source. For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive of\nthe code. There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\nAs a special exception, the copyright holders give permission to link the\ncode of portions of this program with the OpenSSL library under certain\nconditions as described in each individual source file and distribute\nlinked combinations including the program with the OpenSSL library. You\nmust comply with the GNU Affero General Public License in all respects for\nall of the code used other than as permitted herein. If you modify file(s)\nwith this exception, you may extend this exception to your version of the\nfile(s), but you are not obligated to do so. If you do not wish to do so,\ndelete this exception statement from your version. If you delete this\nexception statement from all source files in the program, then also delete\nit in the license file.\n"}