{"key": "rxtx-exception-lgpl-2.1", "short_name": "RXTX exception to LGPL 2.1", "name": "RXTX exception to LGPL 2.1", "category": "Copyleft Limited", "owner": "RXTX", "homepage_url": "http://users.frii.com/jarvi/rxtx/license.html", "is_exception": true, "other_urls": ["http://www.gnu.org/licenses/lgpl-2.1.txt"], "standard_notice": "RXTX License v 2.1 - LGPL v 2.1 + Linking Over Controlled Interface.\nRXTX is a native interface to serial ports in java.\nCopyright 1997-2007 by Trent Jarvi tjarvi@qbang.org and others who\nactually wrote it. See individual source files for more information.\nThis library is free software; you can redistribute it and/or\nmodify it under the terms of the GNU Lesser General Public\nLicense as published by the Free Software Foundation; either\nversion 2.1 of the License, or (at your option) any later version.\nThis library is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\nLesser General Public License for more details.\nAn executable that contains no derivative of any portion of RXTX, but\nis designed to work with RXTX by being dynamically linked with it,\nis considered a \"work that uses the Library\" subject to the terms and\nconditions of the GNU Lesser General Public License.\nThe following has been added to the RXTX License to remove\nany confusion about linking to RXTX. We want to allow in part what\nsection 5, paragraph 2 of the LGPL does not permit in the special\ncase of linking over a controlled interface. The intent is to add a\nJava Specification Request or standards body defined interface in the\nfuture as another exception but one is not currently available.\nhttp://www.fsf.org/licenses/gpl-faq.html#LinkingOverControlledInterface\nAs a special exception, the copyright holders of RXTX give you\npermission to link RXTX with independent modules that communicate with\nRXTX solely through the Sun Microsytems CommAPI interface version 2,\nregardless of the license terms of these independent modules, and to copy\nand distribute the resulting combined work under terms of your choice,\nprovided that every copy of the combined work is accompanied by a complete\ncopy of the source code of RXTX (the version of RXTX used to produce the\ncombined work), being distributed under the terms of the GNU Lesser General\nPublic License plus this exception. An independent module is a\nmodule which is not derived from or based on RXTX.\nNote that people who make modified versions of RXTX are not obligated\nto grant this special exception for their modified versions; it is\ntheir choice whether to do so. The GNU Lesser General Public License\ngives permission to release a modified version without this exception; this\nexception also makes it possible to release a modified version which\ncarries forward this exception.\n"}