{"key": "syntext-serna-exception-1.0", "short_name": "Syntext Serna exception to GPL 2.0 or GPL 3.0", "name": "Syntext Serna exception to GPL 2.0 or GPL 3.0", "category": "Copyleft Limited", "owner": "Syntext", "homepage_url": "https://github.com/ydirson/serna-free/blob/master/GPL_EXCEPTION.txt", "is_exception": true, "other_urls": ["http://www.gnu.org/licenses/gpl-2.0.txt", "http://www.gnu.org/licenses/gpl-3.0.txt"], "standard_notice": "Syntext, Inc. GPL License Exception for Syntext Serna Free Edition\nVersion 1.0\nAdditional rights granted beyond the GPL (the \"Exception\").\nAs a special exception to the terms and conditions of GPL version 2.0\nor GPL version 3.0, Syntext, Inc. hereby grants you the rights described\nbelow,\nprovided you agree to the terms and conditions in this Exception, including\nits\nobligations and restrictions on use.\nNothing in this Exception gives you or anyone else the right to change the\nlicensing terms of the Syntext Serna Free Editon.\n1) Definitions\n\"FOSS Application\" means a free and open source software application\ndistributed subject to a license listed in the section below titled\n\"FOSS License List.\"\n\"Licensed Software\" shall refer to the software licensed under the GPL\nversion 2.0 or GPL version 3.0 and this exception.\n\"Derivative Work\" means a derivative work, as defined under applicable\ncopyright law, formed entirely from the Licensed Software and one or more\nFOSS\nApplications.\n\"Independent Work\" means portions of the Derivative Work that are not\nderived\nfrom the Licensed Software and can reasonably be considered independent and\nseparate works.\n2) The right to use open source licenses not compatible with the GNU\nGeneral\nPublic License version 2.0 or GNU General Public License version 3.0: You\nmay\ndistribute Derivative Work in object code or executable form, provided\nthat:\nA) You distribute Independent Works subject to a license listed in the\nsection 4 below, titled \"FOSS License List\";\nand\nB) You obey the GPL in all respects for the Licensed Software and all\nportions\n(including modifications and extensions) of the Licensed Software included\nin\nthe Derivative Work (provided that this condition does not apply to\nIndependent Works);\nC) You must, on request, make a complete package including the complete\nsource\ncode of Derivative Work (as defined in the GNU General Public License\nversion 2, section 3, but excluding anything excluded by the special\nexception\nin the same section) available to Syntext, Inc. under the same license as\nthat\ngranted to other recipients of the source code of Derivative Work;\nand\nD) Your or any other contributor's rights to:\ni) distribute the source code of Derivative Work to anyone for any purpose;\nand\nii) publicly discuss the development project for Derivative Work and its\ngoals\nin any form and in any forum are not prohibited by any legal instrument,\nincluding but not limited to contracts, non-disclosure agreements, and\nemployee contracts.\n3) Syntext, Inc. reserves all rights not expressly granted in these terms\nand\nconditions. If all of the above conditions are not met, then this FOSS\nLicense\nException does not apply to you or your Derivative Work.\n4) FOSS License List\nLicense name Version\n-----------------------------------------------------------------\nAcademic Free License 2.0, 2.1, 3.0\nApache Software License 1.0 or 1.1\nApache License 2.0\nApple Public Source License 2.0\nArtistic license (as set forth in the addendum file)\nBSD license \"July 22 1999\"\nCommon Development and Distribution License (CDDL) 1.0\nCommon Public License 1.0\nEclipse Public License 1.0\nGNU Library or \"Lesser\" General Public License (LGPL) 2.0, 2.1, 3.0\nJabber Open Source License 1.0\nMIT License (as set forth in the addendum file)\nMozilla Public License (MPL) 1.0 or 1.1\nOpen Software License 2.0, 3.0\nOpenSSL license (with original SSLeay license) \"2003\" (\"1998\")\nPHP License 3.0\nPython license (CNRI Python License) (as set forth in the addendum file)\nPython Software Foundation License 2.1.1\nQ Public License 1.0\nSleepycat License \"1999\"\nW3C License \"2001\"\nX11 License X11R6.6\nZlib/libpng License (as set forth in the addendum file)\nZope Public License 2.0, 2.1\n(Licenses without a specific version number or date are reproduced in the\nfile\nGPL_Exception_Addendum.txt in your source package).\n------------------------------------------------------------------\n"}