{"key": "unlimited-linking-exception-lgpl", "short_name": "Unlimited linking exception to LGPL", "name": "Unlimited linking exception to LGPL", "category": "Copyleft Limited", "owner": "Free Software Foundation (FSF)", "homepage_url": "http://www.eglibc.org/cgi-bin/viewvc.cgi/branches/eglibc-2_18/libc/io/stat64.c?revision=23787&view=markup", "is_exception": true, "spdx_license_key": "LicenseRef-scancode-unlimited-link-exception-lgpl", "other_spdx_license_keys": ["LicenseRef-scancode-unlimited-linking-exception-lgpl"], "other_urls": ["http://www.gnu.org/licenses/lgpl-2.1.txt"], "standard_notice": "Copyright (C) 1996-2013 Free Software Foundation, Inc.\nThis file is part of the GNU C Library.\nThe GNU C Library is free software; you can redistribute it and/or modify\nit under the terms of the GNU Lesser General Public License as published by\nthe Free Software Foundation.\nIn addition to the permissions in the GNU Lesser General Public License,\nthe Free Software Foundation gives you unlimited permission to link the\ncompiled version of this file with other programs, and to distribute those\nprograms without any restriction coming from the use of this file. (The GNU\nLesser General Public License restrictions do apply in other respects; for\nexample, they cover modification of the file, and distribution when not\nlinked into another program.)\nNote that people who make modified versions of this file are not obligated\nto grant this special exception for their modified versions; it is their\nchoice whether to do so. The GNU Lesser General Public License gives\npermission to release a modified version without this exception; this\nexception also makes it possible to release a modified version which\ncarries forward this exception.\nThe GNU C Library is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY\nor FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public\nLicense for more details.\nYou should have received a copy of the GNU Lesser General Public License\nalong with the GNU C Library; if not, see <http://www.gnu.org/licenses/>.\n"}