{"key": "upx-exception-2.0-plus", "short_name": "UPX exception to GPL 2.0 or later", "name": "UPX exception to GPL 2.0 or later", "category": "Copyleft Limited", "owner": "UPX", "homepage_url": "https://github.com/upx/upx/blob/master/LICENSE", "is_exception": true, "other_urls": ["http://wildsau.idv.uni-linz.ac.at/mfx/upx.html", "http://www.nexus.hu/upx", "http://upx.tsx.org", "http://www.gnu.org/licenses/gpl-2.0.txt", "http://www.gnu.org/licenses/gpl-3.0.txt"], "minimum_coverage": 50, "standard_notice": "The Ultimate Packer for eXecutables\nCopyright (c) 1996-2000 Markus Oberhumer & Laszlo Molnar\nhttp://wildsau.idv.uni-linz.ac.at/mfx/upx.html\nhttp://www.nexus.hu/upx\nhttp://upx.tsx.org\nPLEASE CAREFULLY READ THIS LICENSE AGREEMENT, ESPECIALLY IF YOU PLAN\nTO MODIFY THE UPX SOURCE CODE OR USE A MODIFIED UPX VERSION.\nABSTRACT\n========\nUPX and UCL are copyrighted software distributed under the terms of the GNU\nGeneral Public License (hereinafter the \"GPL\").\nThe stub which is imbedded in each UPX compressed program is part of UPX\nand UCL, and contains code that is under our copyright. The terms of the\nGNU General Public License still apply as compressing a program is a\nspecial form of linking with our stub.\nAs a special exception we grant the free usage of UPX for all executables,\nincluding commercial programs.\nSee below for details and restrictions.\nCOPYRIGHT\n=========\nUPX and UCL are copyrighted software. All rights remain with the authors.\nUPX is Copyright (C) 1996-2000 Markus Franz Xaver Johannes Oberhumer\nUPX is Copyright (C) 1996-2000 Laszlo Molnar\nUCL is Copyright (C) 1996-2000 Markus Franz Xaver Johannes Oberhumer\nGNU GENERAL PUBLIC LICENSE\n==========================\nUPX and the UCL library are free software; you can redistribute them and/or\nmodify them under the terms of the GNU General Public License as published\nby the Free Software Foundation; either version 2 of the License, or (at\nyour option) any later version.\nUPX and UCL are distributed in the hope that they will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY\nor FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for\nmore details.\nYou should have received a copy of the GNU General Public License along\nwith this program; see the file COPYING.\nSPECIAL EXCEPTION FOR COMPRESSED EXECUTABLES\n============================================\nThe stub which is imbedded in each UPX compressed program is part of UPX\nand UCL, and contains code that is under our copyright. The terms of the\nGNU General Public License still apply as compressing a program is a\nspecial form of linking with our stub.\nHereby Markus F.X.J. Oberhumer and Laszlo Molnar grant you special\npermission to freely use and distribute all UPX compressed programs\n(including commercial ones), subject to the following restrictions:\n1. You must compress your program with a completely unmodified UPX version;\neither with our precompiled version, or (at your option) with a self\ncompiled version of the unmodified UPX sources as distributed by us.\n2. This also implies that the UPX stub must be completely unmodfied,\ni.e.the stub imbedded in your compressed program must be byte-identical to\nthe stub that is produced by the official unmodified UPX version.\n3. The decompressor and any other code from the stub must exclusively get\nused by the unmodified UPX stub for decompressing your program at program\nstartup. No portion of the stub may get read, copied, called or otherwise\nget used or accessed by your program.\nANNOTATIONS\n===========\n- You can use a modified UPX version or modified UPX stub only for programs\nthat are compatible with the GNU General Public License.\n- We grant you special permission to freely use and distribute all UPX\ncompressed programs. But any modification of the UPX stub (such as, but not\nlimited to, removing our copyright string or making your program non-\ndecompressible) will immediately revoke your right to use and distribute a\nUPX compressed program.\n- UPX is not a software protection tool; by requiring that you use the\nunmodified UPX version for your proprietary programs we\nmake sure that any user can decompress your program. This protects both you\nand your users as nobody can hide malicious code - any program that cannot\nbe decompressed is highly suspicious by definition.\n- You can integrate all or part of UPX and UCL into projects that are\ncompatible with the GNU GPL, but obviously you cannot grant any special\nexceptions beyond the GPL for our code in your project.\n- We want to actively support manufacturers of virus scanners and similar\nsecurity software. Please contact us if you would like to incorporate parts\nof UPX or UCL into such a product.\nMarkus F.X.J. Oberhumer Laszlo Molnar\nmarkus.oberhumer@jk.uni-linz.ac.at ml1050@cdata.tvnet.hu\nLinz, Austria, 25 Feb 2000\n"}