{"key": "wxwindows-exception-3.1", "short_name": "WxWindows Library Exception to GPL 2.0 or later", "name": "WxWindows Library Exception to GPL 2.0 or later", "category": "Copyleft Limited", "owner": "wxWidgets", "homepage_url": "http://www.wxwidgets.org/about/newlicen.htm", "notes": "formerly was SPDX id wxWindows", "is_exception": true, "spdx_license_key": "WxWindows-exception-3.1", "osi_url": "https://opensource.org/licenses/WXwindows", "other_urls": ["http://www.gnu.org/licenses/gpl-2.0.txt", "http://www.opensource.org/licenses/WXwindows"], "standard_notice": "The wxWindows Library Licence\nCopyright (c) 1998 Julian Smart, Robert Roebling [, ...]\nEveryone is permitted to copy and distribute verbatim copies of this\nlicence document, but changing it is not allowed.\nWXWINDOWS LIBRARY LICENCE\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\nThis library is free software; you can redistribute it and/or modify it\nunder the terms of the GNU Library General Public Licence as published by\nthe Free Software Foundation; either version 2 of the Licence, or (at your\noption) any later version.\nThis library is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public\nLicence for more details.\nYou should have received a copy of the GNU Library General Public Licence\nalong with this software, usually in a file named COPYING.LIB. If not,\nwrite to the Free Software Foundation, Inc., 59 Temple Place, Suite 330,\nBoston, MA 02111-1307 USA.\nEXCEPTION NOTICE\n1. As a special exception, the copyright holders of this library give\npermission for additional uses of the text contained in this release of the\nlibrary as licenced under the wxWindows Library Licence, applying either\nversion 3.1 of the Licence, or (at your option) any later version of the\nLicence as published by the copyright holders of version 3.1 of the Licence\ndocument.\n2. The exception is that you may use, copy, link, modify and distribute\nunder your own terms, binary object code versions of works based on\nthe Library.\n3. If you copy code from files distributed under the terms of the GNU\nGeneral Public Licence or the GNU Library General Public Licence into a\ncopy of this library, as this licence permits, the exception does not apply\nto the code that you add in this way. To avoid misleading anyone as to the\nstatus of such modified files, you must delete this exception notice from\nsuch code and/or adjust the licensing conditions notice accordingly.\n4. If you write modifications of your own for this library, it is your\nchoice whether to permit this exception to apply to your modifications. If\nyou do not wish that, you must delete the exception notice from such code\nand/or adjust the licensing conditions notice accordingly.\n"}